{
  "broadArea": {
    "name": "Chemical Engineering",
    "link": "https://www.vlab.co.in/broad-area-chemical-engineering",
    "code": "CHEMENG"
  },
  "lab": "Chemical Process Dynamics",
  "lab_display_name": "Chemical Process Dynamics",
  "phase": 2,
  "collegeName": "IITKGP",
  "baseUrl": "cpd-iitkgp.vlabs.ac.in",
  "introduction": "We, at IIT Kharagpur have developed a few software modules for conducting laboratory experiments virtually. The modules aim to provide a learning experience, similar to the hands on one in a real laboratory, through use of computer simulator and graphic tools. The modules are to be run through internet, and are primarily intended for a wider audience, beyond classroom. The modules cover the dynamics of process variables in traditional systems (e.g., heat exchanger, reactor), and recent methods (e.g., membrane separation, bioreactor).",
  
  "experiments": [
    {
      "name": "Stirred Tank Heater",
      "short-name": "stirred-tank-heater",
      "repo": "https://github.com/virtual-labs/exp-stirred-tank-heater-iitkgp",
      "tag": "v1.0.0",
      "deploy": true
    },
    {
      "name": "Heat Exchanger",
      "short-name": "heat-exchanger",
      "repo": "https://github.com/virtual-labs/exp-heat-exchanger-iitkgp",
      "tag": "v1.0.0",
      "deploy": true
    },
    {
      "name": "Flash Drum",
      "short-name": "flash-drum",
      "repo": "https://github.com/virtual-labs/exp-flash-drum-iitkgp",
      "tag": "v1.0.0",
      "deploy": true
    },
    {
      "name": "Continuous Stirred Tank Reactor",
      "short-name": "continuous-stirred-tank-reactor",
      "repo": "https://github.com/virtual-labs/exp-continuous-stirred-tank-reactor-iitkgp",
      "tag": "v1.0.0",
      "deploy": true
    },
    {
      "name": "Adsorption",
      "short-name": "adsorption",
      "repo": "https://github.com/virtual-labs/exp-adsorption-iitkgp",
      "tag": "v1.0.0",
      "deploy": true
    },
    {
      "name": "Feedbatch Fermentor",
      "short-name": "feedbatch-fermentor",
      "repo": "https://github.com/virtual-labs/exp-feedbatch-fermentor-iitkgp",
      "tag": "v1.0.0",
      "deploy": true
    },
    {
      "name": "Membrane Separation",
      "short-name": "membrane-separation",
      "repo": "https://github.com/virtual-labs/exp-membrane-separation-iitkgp",
      "tag": "v1.0.0",
      "deploy": true
    },
    {
      "name": "Polymerization reactor",
      "short-name": "polymerization-reactor",
      "repo": "https://github.com/virtual-labs/exp-polymerization-reactor-iitkgp",
      "tag": "v1.0.0",
      "deploy": true
    }
  ],
  "targetAudience": {
  "UG":[
    "Undergraduate students students of Chemical Engineering"
  ],
    "PG": [
      "Post-graduate students of Chemical Engineering"
    ]
  },
    
  "objective": "This laboratory course introduces the dynamic of chemical processes, used in industry. The chemical processes can have multiple steady states and non-linear dynamics. The impact is far and wide ,affecting the product quality in core industry to the operation of Bio-medical devices. To underscore the importance of the subject , one may cite fire as an example of a chemical process that is sustained through controlled supply of fuel and air. With inadequate supply, the fire gets extinguished. with more then adequate supply , the fire becomes uncontrollable and devastating. In this course, the following processes are introduced with detailed theoretical treatment, assignment, reference, and video recording, of a live demonstration.\n\n In the virtual experiment, the user sets the operating parameters for each process alongside the equipment and the computer screen. Also, the user sets the unit e.g., valve ,pump, heater, stirrer on or off at appropriate instance, as it is done for real experiment. The equipment and schematics are presented, as they appear in real laboratory by extensive use of animation and graphics tolls. The resulting value of process variable are provided to the user in an interactive mode for further analysis. The user has to record the transient response arising from step change in one operating parameter, and analyses the time constant. The users' input of these parameters will help in monitoring the performance of the user in real time by the help of software. Also, a quiz will be conduct to evaluate user level of understanding .The answers are checked in real time through in-built program.",
  "courseAlignment": {
    "description": "The lab contents are chosen such that it covers the syllabi of the Chemical Engineering course's of various universities.",
    "universities": [
      "IIT Kharagpur"
    ]
  }
}
